<div align="center">
  <br>
  <img src="https://i.ibb.co/DkYw4wF/logo.png" alt="logo" border="0"><br><br>
  МИНОБРНАУКИ РОССИИ<br>
  Федеральное государственное бюджетное<br>
  образовательное учреждение высшего образования
  
#### **«МИРЭА – Российский технологический униврситет»**
  
  Лабораторная работа по дисциплине:<br>
  «Программные средства оперативно-аналитического поиска»
</div>
<br><br><br><br><br>
<div align="right">
  <br>
  Выполнил:<br>
  Студент 4 курса<br>
  Специальности 10.05.05<br>
  Группа ББСО-02-16<br>
  Антипов К.О<br>
  Проверил:<br>
  Захарчук И.И.<br>
</div>
<br><br><br><br><br><br><br>

<p align="center">
  Москва 2020
</p>
<br><br><br>

<div align="center">

#### **Лабораторная работа № 2**

</div>

<p>

#### **Цель работы**

Проанализировать сетевые параметры публичных DNS серверов, сделать мотивированный вывод о предпочтительных серверах
</p>

<p>

#### **Исходные данные**


| Наименование устройства  | Операционная система  |
| ------------------------ | --------------------- |
| XIAOMI MI NOTEBOOK PRO   |    Windows 10 PRO     |

</p>

<p>

#### **Исследуемые провайдеры DNS**

1. [Google Public DNS](https://dns.google.com/)<br>
2. [Cloudflare DNS](https://www.cloudflare.com/dns/)<br>
3. [OpenDNS](https://www.opendns.com/)<br>
4. [QWERTY DNS](https://qwerty.ru/)<br>
</p>

<p>

#### **Используемое ПО **

1. Утилиты traceroute, tracert, ping и whois<br>
2. [Rstudio IDE](rstudio.com)
</p>

<p>

#### **Общий план выполнения работы **

1. Используя утилиты tracert/traceroute построить маршрут
2. На основании маршрута, используя утилиту whois узнать местоположение каждого узла маршрута к DNS-серверу, организацию, владеющую каждым узлом маршрута к DNS-серверу
3. Расчитать среднее RTT к DNS-серверу
4. Выделить те узлы маршрута, которые вносят наибольшую временную задержку при передаче
</p>

 


#### **Процесс выполнения работы**

<p>

* **Google Public DNS**

```{r cache=TRUE}

system("tracert 8.8.8.8", intern = TRUE)

```



|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     1 ms    |    1 ms     |     2 ms    |     192.168.0.1        |   Москва, Россия   |        Роутер         |      1      |                                                   |                         
|  2  |     5 ms    |    5 ms     |     4 ms    |     10.188.128.1       |  Лос-Анджелес, США |         IANA          |     4.6     |                                                   |
|  3  |     5 ms    |    4 ms     |     4 ms    |    213.85.208.254      |   Москва, Россия   | Центральный телеграф  |     4.3     |                                                   |
|  4  |     7 ms    |    8 ms     |     4 ms    |    188.254.54.237      |   Москва, Россия   |      Ростелеком       |     6.3     |                                                   |
|  5  |     4 ms    |    7 ms     |     4 ms    |     72.14.209.89       |  Маунтин-Вью, США  |      Google LLC       |      5      |                                                   |
|  6  |    18 ms    |    8 ms     |     6 ms    |    108.170.250.51      |  Маунтин-Вью, США  |      Google LLC       |    10.6     |                                                   |
|  7  |    20 ms    |   24 ms     |    38 ms    |    216.239.51.32       |  Маунтин-Вью, США  |      Google LLC       |    27.3     |                      Да                           |
|  8  |    26 ms    |   23 ms     |    25 ms    |    172.253.66.110      |  Маунтин-Вью, США  |      Google LLC       |    24.6     |                      Да                           |   
|  9  |    20 ms    |   22 ms     |    20 ms    |    209.85.254.135      |  Маунтин-Вью, США  |      Google LLC       |    20.6     |                      Да                           |
| 10  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |                      
| 11  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 12  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |
| 13  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 14  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 15  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 16  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 17  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |   
| 18  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |   
| 19  |   19 ms     |   20 ms     |    19 ms    |  dns.google [8.8.8.8]  |   Нью-Йорк, США    |      Google LLC       |    19.3     |                      Да                           |

</p>


<p>

* **Cloudflare DNS**

```{r cache=TRUE}
system("tracert 1.1.1.1", intern = TRUE)
```

|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     1 ms    |    1 ms     |     1 ms    |     192.168.0.1        |   Москва, Россия   |        Роутер         |      1      |                                                   |                         
|  2  |     5 ms    |    2 ms     |     2 ms    |     10.188.128.1       |  Лос-Анджелес, США |         IANA          |      3      |                                                   |
|  3  |     5 ms    |    4 ms     |     3 ms    |    213.85.208.254      |   Москва, Россия   | Центральный телеграф  |      4      |                                                   |
|  4  |    15 ms    |    9 ms     |     9 ms    |    188.254.54.237      |   Москва, Россия   |      Ростелеком       |     11      |                                                   |
|  5  |    43 ms    |   14 ms     |    23 ms    |    213.59.211.255      |   Москва, Россия   |      Ростелеком       |    26.6     |                      Да                             |
|  6  |    25 ms    |   33 ms     |    27 ms    |    rostel-gw.ip4.gtt.net [77.67.90.97]      |  Ной-Изенбург, Германия |      Tinet International Network       |    28.3     |            Да                                       |
|  7  |    33 ms    |   30 ms     |    29 ms    |    ae1-500.cr1-stk3.ip4.gtt.net [77.67.90.96]        |  Ной-Изенбург, Германия  |      Tinet International Network       |    30.6     |                      Да                           |
|  8  |    21 ms    |   24 ms     |    23 ms    |    cloudflare-gw.cr0-stk3.ip4.gtt.net [141.136.101.178]      |  Ной-Изенбург, Германия  |      Tinet International Network       |    22.6     |                      Да                           |  
|  9  |    25 ms    |   21 ms     |    21 ms    |    one.one.one.one [1.1.1.1]      |  Брисбен, Австралия  |      Cloudflare DNS       |    22.6     |                      Да                           |

</p>

<p>

* **OpenDNS**

```{r cache=TRUE}

system("tracert 208.67.220.220", intern = TRUE)

```





|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     4 ms    |    2 ms     |     1 ms    |     192.168.0.1        |   Москва, Россия   |        Роутер         |      2.3      |                                                   |                         
|  2  |     225 ms  |    13 ms    |     4 ms    |     10.188.128.1       |  Лос-Анджелес, США |         IANA          |     80.6     |                   да                                |
|  3  |     4 ms    |    7 ms     |     3 ms    |    213.85.208.254      |   Москва, Россия   | Центральный телеграф  |     4.6     |                                                   |
|  4  |     8 ms    |    5 ms     |    22 ms    |    188.254.54.237      |   Москва, Россия   |      Ростелеком       |     11.6     |                                                   |
|  5  |    22 ms    |   21 ms     |    22 ms    |    ae46.stkm-cr4.intl.ip.rostelecom.ru [87.226.133.111]       |  Москва, Россия  |      Ростелеком       |      21.6      |                                                   |
|  6  |    21 ms    |   21 ms     |    22 ms    |    ae1-500.cr1-stk3.ip4.gtt.net [77.67.90.96]      |  Ной-Изенбург, Германия  |      Tinet International Network       |    21.3     |                                                   |
|  7  |    51 ms    |   49 ms     |    51 ms    |    ae13.cr5-ams1.ip4.gtt.net [213.200.117.202]       |  Ной-Изенбург, Германия  |      Tinet International Network       |    50.3     |                      Да                           |
|  8  |    82 ms    |   91 ms     |    101 ms   |    opendns-gw.ip4.gtt.net [77.67.66.70]      |   Ной-Изенбург, Германия  |      Tinet International Network       |    91.3     |                      Да                           |   
|  9  |    84 ms    |   73 ms     |    75 ms    |    resolver2.opendns.com [208.67.220.220]      |    Сан-Франциско, США  |      Cisco OpenDNS LLC       |    77.3     |                      Да                           |

</p>

<p>

* **QWERTY DNS**

```{r cache=TRUE}

system("tracert 213.85.204.190", intern = TRUE)

```

|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     1 ms    |    3 ms     |     1 ms    |     192.168.0.1        |   Москва, Россия   |        Роутер         |     1.6     |                                                   |                         
|  2  |     6 ms    |    5 ms     |     3 ms    |     10.188.128.1       |  Лос-Анджелес, США |         IANA          |     4.6     |                      Да                           |
|  3  |     *    |    *     |     *    |     Request timed out.     |      |   |        |                                                   |
|  4  |     2 ms    |    2 ms     |     2 ms    |    213.85.208.198      |   Москва, Россия   | Центральный телеграф  |     2     |                          да                        |     

</p>

<p>

* **Cравнительную диаграмму RTT к серверам**

Используемые цвета:

1.	Google DNS - Золотой
2.	Сloudflare DNS - Синий
3.	OpenDNS - Красный
4.  Qwerty DNS - Зелёный


```{r, echo=FALSE}
x <- c(1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93)
y <- c(0,0.5,1,1.5,2,2.5,3,3.5,4,4.5,5,5.5,6,6.5,7,7.5,8,8.5,9,9.5,10,10.5,11,11.5,12,12.5,13,13.5,14,14.5,15,15.5,16,16.5,17,17.5,18,18.5,19,19.5,20,20.5,21,21.5,22,22.5,23)
x_google <- c(1,4.6,4.3,6.3,5,10.6,27.3,24.6,20.6,19.3)
y_google <- c(1,2,3,4,5,6,7,8,9,10)
x_cloudflare <- c(1,3,4,11,26.6,28.3,30.6,22.6,22.6)
y_cloudflare <- c(1,2,3,4,5,6,7,8,9)
x_opendns <- c(2.3,80.6,4.6,11.6,21.6,21.3,50.3,91.3,77.3)
y_opendns <- c(1,2,3,4,5,6,7,8,9)
x_qwerty <- c(1.6,4.6,2)
y_qwerty <- c(1,2,3)


plot(y,x,main = "RTT comparison chart for servers", xlab = "Step", ylab = "RTT",type = "n")
points(y_google,x_google, col = "goldenrod")
lines(y_google,x_google, col = "goldenrod")
points(y_cloudflare,x_cloudflare, col = "MediumBlue")
lines(y_cloudflare,x_cloudflare, col = "MediumBlue")
points(y_opendns,x_opendns, col = "IndianRed")
lines(y_opendns,x_opendns, col = "IndianRed")
points(y_qwerty,x_qwerty, col = "green")
lines(y_qwerty,x_qwerty, col = "green")

```
</p>

<p>

#### **Оценка результата** 

Основываясь на полученных данных можно сделать вывод, что самое минимальное время было затрачено на обращение к Qwerty, а максимальное к OpenDNS.

</p>

<p>

#### **Вывод**

В данной лабораторной работе я проанализировал сетевые параметры публичных DNS серверов
</p>

